import java.util.HashMap;

public class ABC {
    public static HashMap<String, String> abc = new HashMap<>();

    public static void fillAbc(){
        abc.put("та-пиии","A");
        abc.put("пиии-та-та-та","Б");
        abc.put("та-пиии-пиии","В");
        abc.put("пиии-пиии-та","Г");
        abc.put("пиии-та-та","Д");
        abc.put("та","Е");
        abc.put("та-та-та-пиии","Ж");
        abc.put("пиии-пиии-та-та","З");
        abc.put("та-та","И");
        abc.put("та-пиии-пиии-пиии","Й");
        abc.put("пиии-та-пиии","К");
        abc.put("та-пиии-та-та","Л");
        abc.put("пиии-пиии","М");
        abc.put("пиии-та","Н");
        abc.put("пиии-пиии-пиии","О");
        abc.put("та-пиии-пиии-та","П");
        abc.put("та-пиии-та","Р");
        abc.put("та-та-та","С");
        abc.put("пиии","Т");
        abc.put("та-та-пиии","У");
        abc.put("та-та-пиии-та","Ф");
        abc.put("та-та-та-та","Х");
        abc.put("пиии-та-пиии-та","Ц");
        abc.put("пиии-пиии-пиии-та","Ч");
        abc.put("пиии-пиии-пиии-пиии","Ш");
        abc.put("пиии-пиии-та-пиии","Щ");
        abc.put("пиии-та-та-пиии","Ь");
        abc.put("пиии-та-пиии-пиии","Ы");
        abc.put("та-та-пиии-та-та","Э");
        abc.put("та-та-пиии-пиии","Ю");
        abc.put("та-пиии-та-пиии","Я");

        abc.put("та-пиии-пиии-пиии-пиии","1");
        abc.put("та-та-пиии-пиии-пиии","2");
        abc.put("та-та-та-пиии-пиии","3");
        abc.put("та-та-та-та-пиии","4");
        abc.put("та-та-та-та-та","5");
        abc.put("пиии-та-та-та-та","6");
        abc.put("пиии-пиии-та-та-та","7");
        abc.put("пиии-пиии-пиии-та-та","8");
        abc.put("пиии-пиии-пиии-пиии-та","9");
        abc.put("пиии-пиии-пиии-пиии-пиии","0");

        abc.put(" "," ");
        abc.put("та-та-та-та-та-та",".");
        abc.put("та-пиии-та-пиии-та-пиии",",");
        abc.put("пиии-та-пиии-та-пиии-та",";");
        abc.put("пиии-пиии-пиии-та-та-та",":");
        abc.put("та-та-пиии-пиии-та-та","?");
        abc.put("пиии-пиии-та-та-пиии-пиии","!");
        abc.put("пиии-та-та-та-та-пиии","-");
        abc.put("та-пиии-та-та-пиии-та","\"");
        abc.put("пиии-та-пиии-пиии-та-пиии","(");
        abc.put("пиии-та-та-пиии-та","/");
    }
}
